vtoanb/msp430lioamaintain/HAL/hal_ek-lm4f120XL.c
    if (button == BUTTON_2)
        return ((~buttonState2) & GPIO_PIN_4);

    // invalid buttonId, so return false
    return 0;
}


/** The UART has a 16 byte FIFO buffer, so our printf() methods return even though the processor
 * is still outputting bytes on the UART.
 * @return 1 if the Debug UART is busy sending data or 0 if not. Useful to postpone sleeping until the UART
 * has sent all data.
 */
uint8_t halUartBusy()
{
	return (UARTBusy(UART0_BASE));
}


/**
 Debug console interrupt service routine, called when a byte is received on UART.
 @pre In startup_ccs.c, UARTIntHandler is set as the ISR for the UART0 Rx and Tx interrupt
 @pre In startup_ccs.c, this function is declared, e.g:
 <pre>
 extern void UARTIntHandler(void);
 </pre>
 @pre Interrupts have been enabled, e.g:
 <pre>
 IntMasterEnable();
 IntEnable(INT_UART0);
 UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
 </pre>
 @pre UART has been configured
 @post a byte received on the UART will result in debugConsoleIsr() function pointer called
 */
void UARTIntHandler(void)
{
    unsigned long ulStatus;

    // Get the interrupt status.
    ulStatus = UARTIntStatus(UART0_BASE, true);

    // Clear the asserted interrupts.
    UARTIntClear(UART0_BASE, ulStatus);

    // Loop while there are characters in the receive FIFO.
    while(UARTCharsAvail(UART0_BASE))
    {
        // Read the next character from the UART
    	uint8_t c = (uint8_t) UARTCharGetNonBlocking(UART0_BASE);
        debugConsoleIsr(c);    // call the function pointer
    }
}

#define NUM_LEDS 4

/**
Toggles the specified LED.
@param led the LED to toggle
@post The specified LED is toggled.
@return 0 if success, -1 if invalid LED specified
*/
int16_t toggleLed(uint8_t led)
{
	if (led >= NUM_LEDS)
		return -1;
	switch (led)
	{
	case 0:
		GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_5,~GPIOPinRead(GPIO_PORTB_BASE, GPIO_PIN_5));
		break;
	case 1:		// Red
		GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_6,~GPIOPinRead(GPIO_PORTA_BASE, GPIO_PIN_6));
		break;
	case 2:
		GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_4,~GPIOPinRead(GPIO_PORTA_BASE, GPIO_PIN_4));
		break;
	case 3:
		GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2,~GPIOPinRead(GPIO_PORTB_BASE, GPIO_PIN_2));
		break;
	default:		// should never happen
		return -2;
	}

	return 0;
}

/**
Turns ON the specified LED.
@param led the LED to turn on
@post The specified LED is turned on.
@return 0 if success, -1 if invalid LED specified
*/
int16_t setLed(uint8_t led)
{
	if (led >= NUM_LEDS)
		return -1;
	switch (led)
	{
	case 0:
		GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_5, GPIO_PIN_5);
		break;
	case 1:		// Red
		GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_6, 0);
		break;
	case 2:     // Green
		GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_4, 0);
		break;
	case 3:     // Blue
		GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, 0);
		break;
	default:		// should never happen
		return -2;
	}
	return 0;
}

/**
Turns OFF the specified LED.
@param led the LED to turn off
@post The specified LED is turned on.
@return 0 if success, -1 if invalid LED specified
*/
int16_t clearLed(uint8_t led)
{
    if (led >= NUM_LEDS)
        return -1;
    switch (led)
    {
    case 0:
        GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_5, 0);
        break;
    case 1:     // BoosterPack RGB Red
        GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_6, GPIO_PIN_6);
        break;
    case 2:     // BoosterPack RGB Green
        GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_4, GPIO_PIN_4);
        break;
    case 3:     // BoosterPack RGB Blue
        GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);
        break;
    default:        // should never happen
        return -2;
    }
    return 0;
}

/**
Turns OFF LEDs.
@post LEDs are turned off.
*/
void clearLeds()
{
	GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_5, 0);  //turn off LED
	GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_6, GPIO_PIN_6);
	GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_4, GPIO_PIN_4);
	GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);
}

/**
Initializes the Serial Peripheral Interface (SPI) interface to the Zigbee Module (ZM).
@note Maximum module SPI clock speed is 4MHz. SPI port configured for clock polarity of 0, clock
phase of 0, and MSB first.
@note The Stellaris LaunchPad uses SSI2 to communicate with module
@pre SPI pins configured correctly:
- Clock, MOSI, MISO configured as SPI function
- Chip Select configured as an output
- SRDY configured as an input.
@post SPI port is configured for communications with the module.
*/
void halSpiInitModule()
{
    // Disable the SSI Port
    //SSIDisable(SSI2_BASE);

    // Reconfigure the SSI Port for Module operation.
    // Clock polarity = inactive is LOW (CPOL=0); Clock Phase = 0; MSB first; Master Mode, 2MHz, data is 8bits wide;
    SSIConfigSetExpClk(SSI2_BASE, SysCtlClockGet(), SSI_FRF_MOTO_MODE_0, SSI_MODE_MASTER, 1000000, 8);

    // Enable the SSI Port
    SSIEnable(SSI2_BASE);

    //
    // Read any residual data from the SSI port.  This makes sure the receive
    // FIFOs are empty, so we don't read any unwanted junk.  This is done here
    // because the SPI SSI mode is full-duplex, which allows you to send and
    // receive at the same time.  The SSIDataGetNonBlocking function returns
    // "true" when data was returned, and "false" when no data was returned.
    // The "non-blocking" function checks if there is any data in the receive
    // FIFO and does not "hang" if there isn't.
    //
    uint32_t ulDataRx[5];
    while(SSIDataGetNonBlocking(SSI2_BASE, &ulDataRx[0]))
    {
    }

    // Don't select the module
    SPI_SS_CLEAR();
}

/**
Sends a message over SPI to the Module.
SPI uses a "write-to-read" approach to read data out, you must write data in.
This is a private method that gets wrapped by other methods, e.g. spiSreq(), spiPoll(), etc.
To Write, set *bytes, numBytes.
To Read, set *bytes only. Don't need to set numBytes because Module will stop when no more bytes read.
@param bytes the data to be sent or received.
@param numBytes the number of bytes to be sent. This same buffer will be overwritten with the received data.
@note Modify this method for other hardware implementations.
@pre SPI port configured for writing
@pre Module has been initialized
@post bytes contains received data, if any
@see Stellaris Application Note spma002.pdf, "Adding 32kB of Serial SRAM to a Stellaris Microcontroller"
*/
void spiWrite(unsigned char *bytes, unsigned char numBytes)
{
	uint32_t ulReadData;
	while(numBytes--)    // Loop while there are more bytes left to be transferred.
    {
        SSIDataPut(SSI2_BASE, *bytes);              // Write the next byte to the SSI controller with a blocking put.
        SSIDataGet(SSI2_BASE, &ulReadData);         // Read into a long first
        *bytes++ = (unsigned char)ulReadData;       // ...and then convert it to a char
    }

	/* Note: Stellaris processors have a tx/rx FIFO. If you'd like to wait until the FIFO is empty
	 * before returning from this method, include the following code:
	 */
    //while ( (~HWREG(SSI0_BASE + SSI_O_SR)) & SSI_SR_TFE) ;   //wait while Transmit FIFO is NOT empty
	//while ( (HWREG(SSI0_BASE + SSI_O_SR)) & SSI_SR_BSY) ;   //wait while busy - works without this
}


/**
A fairly accurate Blocking Delay in Milliseconds - delays by at least the specified number of
milliseconds (mSec)
@pre SysCtlClockSet() has been called to set the processor clock rate
@param ms number of milliseconds to delay
@note change if you are using an RTOS.
*/
void delayMs(uint16_t ms)
{
	SysCtlDelay((SysCtlClockGet() / 3000) * ms);   // Is 1000 * 3 (since each SysCtlClockGet() call is 3 clock cycles)
}

/**
Initializes the PWM engine used for the RGB LED. This allows the RGB LED to display many colors.
@post RGB LED may be used, with halRgbSetLeds().
*/
void halRgbLedPwmInit()
{
    RGBInit(0);
	RGBIntensitySet(0.5f);
    RGBEnable();
    halRgbSetLeds(0x7F, 0x7F, 0x7F);   // A dim white
}

/**
Sets RGB LED color to the selected values.
@pre halRgbLedPwmInit() has been called to initialize the PWM engine.
@post RGB LED displays the selected colors.
@note you must include hal_ek-lm4f120XL_rgb.h in this file and ensure that the .c file is included in the build path
*/
void halRgbSetLeds(uint8_t red, uint8_t blue, uint8_t green)
{
    unsigned long ulColor[3];
#ifdef DEBUG_HAL_RGB_SET_LEDS
    printf("halRgbSetLeds: R=%02x, B=%02x, G=%02x\r\n", red, blue, green);
#endif
    ulColor[RED] = (unsigned long) ( (red << 8) * (RED_WHITE_BALANCE));
    ulColor[BLUE] = (unsigned long) ( (blue << 8) * (BLUE_WHITE_BALANCE));
    ulColor[GREEN] = (unsigned long) ( (green << 8) * (GREEN_WHITE_BALANCE));

